app/views/tasks/_index.html.erb

SELECT COUNT(*) FROM "pomodoros" WHERE "pomodoros"."task_id" = ?  [["task_id", 1]]
---
        <td><%= task.body %></td>
        <td><i class="far fa-clock"></i><%= task.pomodoros.count %></td>