app/views/tasks/show.html.erb

      <h5>実施回数</h4>
      <p><i class="far fa-clock"></i> <%= pluralize(@task.pomodoros.count, 'set') %></p>
---
SELECT  "pomodoros".* FROM "pomodoros" WHERE "pomodoros"."task_id" = ? ORDER BY "pomodoros"."id" DESC LIMIT ?  [["task_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "pomodoros" WHERE "pomodoros"."task_id" = ?  [["task_id", 1]]

      <p><%= @task.created_at.to_s(:datetime_jp) %></p>
      <% if @task.pomodoros.exists? %>
        <h5>最後に実施した日時</h4>
        <p><%= @task.pomodoros.last.created_at.to_s(:datetime_jp) %></p>
---
SELECT  1 AS one FROM "pomodoros" WHERE "pomodoros"."task_id" = ? LIMIT ?  [["task_id", 1], ["LIMIT", 1]]
SELECT  "pomodoros".* FROM "pomodoros" WHERE "pomodoros"."task_id" = ? ORDER BY "pomodoros"."id" DESC LIMIT ?  [["task_id", 1], ["LIMIT", 1]]