app/views/tasks/timer.html.erb

SELECT COUNT(*) FROM "pomodoros" WHERE "pomodoros"."task_id" = ?  [["task_id", 1]]
---
  		<h2><%= @task.title %></h2>
  		<h5><i class="far fa-clock"></i> <%= @task.pomodoros.count+1 %> set目</h5>