app/views/users/_info.html.erb

SELECT "pomodoros".* FROM "pomodoros" WHERE "pomodoros"."user_id" = ? AND "pomodoros"."created_at" = ?  [["user_id", 1], ["created_at", "2021-10-24"]]
SELECT COUNT(*) FROM "pomodoros" WHERE "pomodoros"."user_id" = ? AND "pomodoros"."created_at" = ?  [["user_id", 1], ["created_at", "2021-10-23"]]
---
	  <th>今日</th>
	  <th><i class="far fa-clock"></i> <%= pluralize(user.pomodoros.where("created_at > ?", Date.yesterday.end_of_day).count, 'set') %></th>

SELECT COUNT(*) FROM "pomodoros" WHERE "pomodoros"."user_id" = ? AND (created_at > '2021-10-18','2021-10-19','2021-10-20','2021-10-21','2021-10-22','2021-10-23','2021-10-24')  [["user_id", 1]]
---
    <th>今週</th>
    <th><i class="far fa-clock"></i> <%= pluralize(user.pomodoros.where("created_at > ?", Date.current.beginning_of_week).count, 'set') %></th>

SELECT "pomodoros".* FROM "pomodoros" WHERE "pomodoros"."user_id" = ? AND "pomodoros"."created_at" = ?  [["user_id", 1], ["created_at", "2021-10-24"]]
SELECT COUNT(*) FROM "pomodoros" WHERE "pomodoros"."user_id" = ? AND "pomodoros"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["created_at", "2021-10-01"], ["created_at", "2021-10-31"]]
---
    <th>今月</th>
    <th><i class="far fa-clock"></i> <%= pluralize(user.pomodoros.where("created_at > ?", Date.current.beginning_of_month).count, 'set') %></th>