app/controllers/pomodoros_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "pomodoros" ("user_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["task_id", 1], ["created_at", "2021-10-23 14:24:23.053304"], ["updated_at", "2021-10-23 14:24:23.053304"]]
---
    task = Task.find(params[:task_id])
    pomodoro = task.pomodoros.new(user_id: current_user.id)
    pomodoro.save