app/controllers/tasks_controller.rb

  def create
    @new_task = Task.new(task_params)
    @new_task.is_finished = false
    @new_task.user_id = current_user.id
    if @new_task.save
---
INSERT INTO "tasks" ("title", "body", "is_finished", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "部屋の掃除"], ["body", ""], ["is_finished", 0], ["user_id", 1], ["created_at", "2021-10-23 10:58:55.386163"], ["updated_at", "2021-10-23 10:58:55.386163"]]

  def update
    if @task.update(edit_task_params)
---
UPDATE "tasks" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "〇〇会議レジュメの作成"], ["body", "△△について"], ["updated_at", "2021-10-26 08:41:10.951926"], ["id", 5]]

  def ensure_correct_user
    @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]