app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", ""], ["profile_image_id", "a03b09e3562e58d898b259dc75a07c576113b940469fab9081ed344e4269"], ["updated_at", "2021-10-26 08:44:32.819194"], ["id", 1]]